# Exercise 7.23

In [1]:
import pandas as pd

In [2]:
temps = {
    'Maxine': [98.6, 96.9, 97.7], 
    'James': [98.9, 100.3, 101.1], 
    'Amanda': [98.5, 98.3, 98.7]
}

In [3]:
temperatures = pd.DataFrame(temps)

In [4]:
temperatures

   Maxine  James  Amanda
0    98.6   98.9    98.5
1    96.9  100.3    98.3
2    97.7  101.1    98.7

In [5]:
temperatures = pd.DataFrame(temps, 
                            index=['Morning', 'Afternoon','Evening'])

In [6]:
temperatures

           Maxine  James  Amanda
Morning      98.6   98.9    98.5
Afternoon    96.9  100.3    98.3
Evening      97.7  101.1    98.7

In [7]:
temperatures.Maxine

Morning      98.6
Afternoon    96.9
Evening      97.7
Name: Maxine, dtype: float64

In [8]:
temperatures.loc['Morning']

Maxine    98.6
James     98.9
Amanda    98.5
Name: Morning, dtype: float64

In [9]:
temperatures.loc[['Morning', 'Evening']]

         Maxine  James  Amanda
Morning    98.6   98.9    98.5
Evening    97.7  101.1    98.7

In [10]:
temperatures.loc[:, ['Amanda', 'Maxine']]

           Amanda  Maxine
Morning      98.5    98.6
Afternoon    98.3    96.9
Evening      98.7    97.7

In [11]:
temperatures.loc['Morning':'Afternoon', ['Amanda', 'Maxine']]

           Amanda  Maxine
Morning      98.5    98.6
Afternoon    98.3    96.9

In [12]:
temperatures.describe()

          Maxine       James  Amanda
count   3.000000    3.000000     3.0
mean   97.733333  100.100000    98.5
std     0.850490    1.113553     0.2
min    96.900000   98.900000    98.3
25%    97.300000   99.600000    98.4
50%    97.700000  100.300000    98.5
75%    98.150000  100.700000    98.6
max    98.600000  101.100000    98.7

In [13]:
temperatures.T

        Morning  Afternoon  Evening
Maxine     98.6       96.9     97.7
James      98.9      100.3    101.1
Amanda     98.5       98.3     98.7

In [14]:
temperatures.sort_index(axis=1)

           Amanda  James  Maxine
Morning      98.5   98.9    98.6
Afternoon    98.3  100.3    96.9
Evening      98.7  101.1    97.7

In [15]:
##########################################################################
# (C) Copyright 2019 by Deitel & Associates, Inc. and                    #
# Pearson Education, Inc. All Rights Reserved.                           #
#                                                                        #
# DISCLAIMER: The authors and publisher of this book have used their     #
# best efforts in preparing the book. These efforts include the          #
# development, research, and testing of the theories and programs        #
# to determine their effectiveness. The authors and publisher make       #
# no warranty of any kind, expressed or implied, with regard to these    #
# programs or to the documentation contained in these books. The authors #
# and publisher shall not be liable in any event for incidental or       #
# consequential damages in connection with, or arising out of, the       #
# furnishing, performance, or use of these programs.                     #
##########################################################################